Revit 2027 API
BuiltInFailures.StairRampFailures.RiserIntWithBoundaryMoreThanOnceFailure Property
 Riser intersects with boundary more than once.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RiserIntWithBoundaryMoreThanOnceFailure { get; }
Public Shared ReadOnly Property RiserIntWithBoundaryMoreThanOnceFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RiserIntWithBoundaryMoreThanOnceFailure {
	FailureDefinitionId^ get ();
}
static member RiserIntWithBoundaryMoreThanOnceFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace